# Essential Command Line Tools
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "jq"

# Modern CLI Tools
brew "ripgrep"
brew "fd"
brew "bat"
brew "exa"
brew "fzf"
brew "ranger"  # Terminal file manager
brew "ncdu"    # Disk usage analyzer
brew "tldr"    # Simplified man pages
brew "cheat"   # Cheat sheets
brew "httpie"  # HTTP client
brew "jq"      # JSON processor
brew "yq"      # YAML processor
brew "xsv"     # CSV toolkit

# Development Languages
brew "node"
brew "python@3.11"
brew "go"
brew "rust"

# Text Editors
brew "neovim"
brew "vim"

# Terminal Tools
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

# Container Tools
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "helm"

# Database Tools
brew "mysql"
brew "postgresql@14"
brew "redis"
brew "mongodb/brew/mongodb-community"

# Version Control
brew "gh"  # GitHub CLI
brew "git-lfs"

# Cloud Tools
brew "awscli"
brew "terraform"
brew "ansible"

# Utilities
brew "grep"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "coreutils"
brew "gzip"
brew "zip"
brew "unzip"
brew "7zip"

# Development Tools
brew "pre-commit"
brew "git-delta"  # Better git diff
brew "lazygit"    # Git UI
brew "gitui"      # Git UI

# Cask Applications (GUI Apps)
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "google-chrome"
cask "slack"
cask "raycast"
cask "rectangle"
cask "alt-tab"
cask "cleanmymac"
cask "the-unarchiver"
cask "spotify"
